#+TITLE: First Iteration

** Multiplexer
Now the heart of the code, without this set the presentation will not work correctly.
For each presentation we will generate a unique id and secret and place them here.

Withou our server running, we can generate new tokens by curling...
#+begin_src shell :results output :exports neverexport
curl http://localhost:1948/token | jq .
#+end_src

#+RESULTS:
: {
:   "secret": "16260577905048685295",
:   "socketId": "01314e83ea20ee4e"
: }

both of the url settings are required, and point to our running multiplex server.

#+REVEAL_MULTIPLEX_URL: http://localhost:1948
#+REVEAL_MULTIPLEX_SOCKETIO_URL: http://localhost:1948/socket.io/socket.io.js
#+REVEAL_MULTIPLEX_ID: 01314e83ea20ee4e
#+REVEAL_MULTIPLEX_SECRET: 16260577905048685295
